Revit 2024 API
AnalyticalStructuralRole Enumeration
 Indicates the structural role for the analytical elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Since: 2023
Syntax
C#
public enum AnalyticalStructuralRole
Visual Basic
Public Enumeration AnalyticalStructuralRole
Visual C++
public enum class AnalyticalStructuralRole
Members
Member name | Description
Unset |  No structural role by default.
StructuralRoleBeam |  Member plays role of structural beam.
StructuralRoleColumn |  Member plays role of structural column.
StructuralRoleMember |  Member plays role of structural member.
StructuralRoleGirder |  Member plays role of structural girder.
StructuralRoleFloor |  Member plays role of structural floor.
StructuralRoleWall |  Member plays role of structural wall.
StructuralRolePanel |  Member plays role of structural panel.
See Also
Autodesk.Revit.DB.Structure Namespace